clear;
clc;
% Задати координати вершин трикутників
x = [0 1 0.5; 1 1.5 1; 1.5 2 2.5];
y = [0 0 1; 0 1 1.5; 1.5 1.5 2];
z = [0 0.5 1; 0.5 1 0.5; 1 0.5 1.5];

% Додати трикутники на графік
patch(x', y', z', 'r');

% Замалювати поверхню через вершини трикутників
hold on; % Включити режим утримування графіку
%for i = 1:size(x, 2)
 %   fill3(x(:, i), y(:, i), z(:, i), 'b', 'FaceAlpha', 0.5); % Замалювати поверхню з синьою кольоровою заливкою
%end
hold off; % Вимкнути режим утримування графіку

xlabel('x');
ylabel('y');
zlabel('z');
title('3D Plot з поверхнею, що проходить через вершини трикутників');
